Revit 2027 API
ParameterTypeId.SteelElemShearstudTotalWeight Property
 "Total Weight"
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public static ForgeTypeId SteelElemShearstudTotalWeight { get; }
Public Shared ReadOnly Property SteelElemShearstudTotalWeight As ForgeTypeId
	Get
public:
static property ForgeTypeId^ SteelElemShearstudTotalWeight {
	ForgeTypeId^ get ();
}
static member SteelElemShearstudTotalWeight : ForgeTypeId with get
Property Value
ForgeTypeId
See Also
Reference
ParameterTypeId Class
Autodesk.Revit.DB Namespace